/*******************************************************************************
Copyright 2008 - 2016 深圳市信盈达科技有限公司. All rights reserved.
文件名:       SHT20.h
描述   :      温湿度
作者   :      Jahol Fan 
版本   :      v1.0
修改   :   
完成日期：    2016.10.13
*******************************************************************************/
#ifndef SHT20_H
#define SHT20_H

#ifdef __cplusplus
extern "C"
{
#endif

/*********************************************************************
 * INCLUDES
 */

/*********************************************************************
*  EXTERNAL VARIABLES
*/

/*********************************************************************
 * CONSTANTS
 */
#include "stm32f4xx.h"
typedef struct
{
	float temperature; //湿度
	float humidity;    //温度
}TempHumiValue_t;
/*********************************************************************
 * MACROS
 */

/*********************************************************************
 * FUNCTIONS
 */

void SHT20_Init(void);
TempHumiValue_t * SHT20_readTemAndHum(void);
float SHT20_readTemOrHum(u8 commod);


/*********************************************************************
*********************************************************************/

#ifdef __cplusplus
}
#endif

#endif /* SHT20_H */
